Revit 2026 API

# StairsRunActualRisersNumber Property

---

The actual number of stairs risers in the stairs run.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int ActualRisersNumber { get; }
```
```vb
Public ReadOnly Property ActualRisersNumber As Integer
	Get
```
```cpp
public:
property int ActualRisersNumber {
	int get ();
}
```
```fsharp
member ActualRisersNumber : int with get
```

#### Property Value

Int32

This is a read-only value.

#### Reference

StairsRun Class

Autodesk.Revit.DB.Architecture Namespace